#+TITLE: A Markovian nursery game
#+INCLUDE: "../html-head.org"

** Four lines of BQN

With the recurrence fully specified, all that remains is to evaluate it exactly over the finite state lattice[fn:5].
The monotonicity we observed earlier means we can compute \(V\) bottom-up. In a scalar implementation one
would index neighbors one by one to fetch the values \(V(\mathbf f-\mathbf e_i,r)\). But in BQN we have powerful
rank polymorphism and shifting functions!

My implementation clones the lattice \(t\) times (one per tree), and shifts at rank \(i\) to model
subtracting \(\mathbf e_i\). The function =»= pads vacated entries with fills, which is exactly what
we want: states beyond the boundary (e.g. trying to harvest from an empty tree) contribute nothing.
We seed the absorbing victory boundary by setting \(V(\mathbf 0,r)=1\) and then repeatedly apply
the /dead-roll/-normalized transition to propagate values outward across the lattice.

The policy functions discussed in the previous section become:

#+begin_src bqn :tangle ../bqn/cg.bqn :exports code
  O ← {+´+·+´((<⊑∘⍒¨𝕩)=⌽↕=𝕩)⊸×}
  T ← {(1+1÷1⌈+´¨0<𝕩)×+´}
#+end_src

Which can be nicely plugged into the driver 1-modifier:

#+begin_src bqn :tangle ../bqn/cg.bqn :exports code
  _eog ← {𝔽_𝕣 t‿f‿r:
    p‿d‿v‿s ← ⟨1⌾⊑0¨, (t+2)-·+´¨0⊸=, 𝔽, +´¨⟩{𝕎𝕩}¨<↕t⥊f+1
    ⊢´⥊{p𝕏{𝕩+(𝕨=s)×(d÷˜𝕗+V)𝕩{»⎉𝕩𝕗}¨1+↕t}´-⟜↕t×f}⍟r 0¨s
  }
#+end_src

Since the raven advances strictly forward, it acts as a discrete arrow of time. Instead of a massive rank
5 tensor, we allocate only the spatial grid and (implicitly) evolve it backward in time with =⍟r=. Inside
each time step, we fold through the total fruit sums bottom-up. Because states with the exact same fruit
sum cannot transition into each other, they are mutually independent.  This allows us to apply our
finite difference stencil to the entire universe simultaneously, using the boolean mask =𝕨=s= to
lock in only the probabilities for the current active wavefront. Finally, the completed probability tensor
from the previous raven step is injected into the inner loop as an operand =𝕏→𝕗= to
supply the \(V(\mathbf{f},r+1)\) term. Running for the standard setup (four trees, four fruits each, raven
track length five) takes \(\mu\)s in CBQN:

#+begin_src bqn :tangle ../bqn/cg.bqn :exports both
  O‿T {𝕎_eog𝕩}¨ <4‿4‿5
#+end_src

#+RESULTS:
: ⟨ 0.6313573066006354 0.596632015719557 ⟩

Not quite the trivial nursery game huh?

[fn:1] That's what the section title says in German. Try saying it out loud three times.
[fn:2] The game is very popular in German-speaking countries, and it is known as "First Orchard" in English.
As I suspected, calculating the true odds of winning is hard enough to inspire [[https://www.stochastik-in-der-schule.de/sisonline/Jahrgang41-2021/Heft%201/Stochastik_1_2021_9_18.pdf][papers]] and [[https://www.youtube.com/watch?v=5WXzEbm68XI][videos]].
[fn:3] The mechanics are simple: there are \(t\) trees, each starting with \(f_{max}\) fruits.
Players take turns rolling a \(t+2\)-sided die. Rolling one of the \(t\) colors lets you harvest
a fruit from the matching tree (if the tree is empty, nothing happens).
Rolling the side /basket/ lets the players collaboratively pick any available fruit.
Finally, rolling the side /raven/ advances a wooden bird one step down a path of \(r_{max}\) steps.
If you collect all \(f_{max}\times t\) fruits before the raven reaches the orchard, everyone wins.
If the raven arrives first, too bad.
[fn:4]  Without the basket choice, evaluating the next turn is simply a passive weighted average
via the [[https://en.wikipedia.org/wiki/Law_of_total_probability][Law of total probability]]. Injecting the max operator to account for the players' optimal
decision is exactly what transforms this passive probability into the Bellman optimality equation.
[fn:5] Finally some code which I will present as if it didn't take ages to refine!

#+INCLUDE: "../html-foot.org"
